debug_infos/20260713_current_best_h11_5_h10_8_plus_h10_only/original/candidate/full_runs/run3/run_throughput.log
===== throughput: 4-8K =====
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fb2cc194af0>, trust_remote_code=False, seed=0, num_prompts=50, dataset_name='custom', no_stream=False, dataset_path='./4-8K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='../Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/public/home/tangyu408/testdata/goal_runs/20260712_h11_5_h10_8_full_run3/results/4-8K_throughput', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-8e5d3c64-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-12 14:38:13 [datasets.py:232] Skipping oversampling. Total samples: 50.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:11<00:00,  5.77s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 50/50 [10:45<00:00, 12.90s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     50        
Failed requests:                         0         
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  645.20    
Total input tokens:                      315769    
Total generated tokens:                  12636     
Request throughput (req/s):              0.08      
Output token throughput (tok/s):         19.58     
Peak output token throughput (tok/s):    24.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          509.00    
---------------Time to First Token----------------
Mean TTFT (ms):                          1547.33   
Median TTFT (ms):                        1624.99   
P50 TTFT (ms):                           1624.99   
P95 TTFT (ms):                           1877.09   
P99 TTFT (ms):                           1956.99   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          45.01     
Median TPOT (ms):                        45.03     
P50 TPOT (ms):                           45.03     
P95 TPOT (ms):                           45.22     
P99 TPOT (ms):                           45.29     
---------------Inter-token Latency----------------
Mean ITL (ms):                           44.88     
Median ITL (ms):                         45.06     
P50 ITL (ms):                            45.06     
P95 ITL (ms):                            45.59     
P99 ITL (ms):                            46.18     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          12888.33  
Median E2EL (ms):                        5528.10   
P50 E2EL (ms):                           5528.10   
P95 E2EL (ms):                           47788.06  
P99 E2EL (ms):                           48058.97  
==================================================
===== throughput: 8-16K =====
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f9e57d38af0>, trust_remote_code=False, seed=0, num_prompts=50, dataset_name='custom', no_stream=False, dataset_path='./8-16K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='../Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/public/home/tangyu408/testdata/goal_runs/20260712_h11_5_h10_8_full_run3/results/8-16K_throughput', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-9ac273de-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-12 14:49:40 [datasets.py:232] Skipping oversampling. Total samples: 50.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:16<00:00,  8.00s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 50/50 [13:22<00:00, 16.05s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     50        
Failed requests:                         0         
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  802.64    
Total input tokens:                      664763    
Total generated tokens:                  13746     
Request throughput (req/s):              0.06      
Output token throughput (tok/s):         17.13     
Peak output token throughput (tok/s):    23.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          845.35    
---------------Time to First Token----------------
Mean TTFT (ms):                          3503.31   
Median TTFT (ms):                        3735.02   
P50 TTFT (ms):                           3735.02   
P95 TTFT (ms):                           4315.72   
P99 TTFT (ms):                           4318.68   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          45.71     
Median TPOT (ms):                        45.67     
P50 TPOT (ms):                           45.67     
P95 TPOT (ms):                           46.19     
P99 TPOT (ms):                           46.20     
---------------Inter-token Latency----------------
Mean ITL (ms):                           45.59     
Median ITL (ms):                         45.78     
P50 ITL (ms):                            45.78     
P95 ITL (ms):                            46.35     
P99 ITL (ms):                            46.93     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          16037.19  
Median E2EL (ms):                        7245.07   
P50 E2EL (ms):                           7245.07   
P95 E2EL (ms):                           49232.10  
P99 E2EL (ms):                           50198.58  
==================================================
===== throughput: 16-32K =====
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f8237c14af0>, trust_remote_code=False, seed=0, num_prompts=50, dataset_name='custom', no_stream=False, dataset_path='./16-32K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='../Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/public/home/tangyu408/testdata/goal_runs/20260712_h11_5_h10_8_full_run3/results/16-32K_throughput', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-d1d89ecf-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-12 15:03:51 [datasets.py:232] Skipping oversampling. Total samples: 50.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:14<00:00,  7.03s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 50/50 [13:26<00:00, 16.13s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     50        
Failed requests:                         0         
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  806.25    
Total input tokens:                      1078097   
Total generated tokens:                  10485     
Request throughput (req/s):              0.06      
Output token throughput (tok/s):         13.00     
Peak output token throughput (tok/s):    23.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          1350.18   
---------------Time to First Token----------------
Mean TTFT (ms):                          6278.61   
Median TTFT (ms):                        6304.24   
P50 TTFT (ms):                           6304.24   
P95 TTFT (ms):                           6538.65   
P99 TTFT (ms):                           6549.85   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          46.87     
Median TPOT (ms):                        47.00     
P50 TPOT (ms):                           47.00     
P95 TPOT (ms):                           47.18     
P99 TPOT (ms):                           47.23     
---------------Inter-token Latency----------------
Mean ITL (ms):                           46.88     
Median ITL (ms):                         47.13     
P50 ITL (ms):                            47.13     
P95 ITL (ms):                            47.67     
P99 ITL (ms):                            48.26     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          16109.44  
Median E2EL (ms):                        14131.46  
P50 E2EL (ms):                           14131.46  
P95 E2EL (ms):                           41685.88  
P99 E2EL (ms):                           54858.21  
==================================================

===== result files =====
/public/home/tangyu408/testdata/goal_runs/20260712_h11_5_h10_8_full_run3/results/4-8K_throughput/result.json
/public/home/tangyu408/testdata/goal_runs/20260712_h11_5_h10_8_full_run3/results/8-16K_throughput/result.json
/public/home/tangyu408/testdata/goal_runs/20260712_h11_5_h10_8_full_run3/results/16-32K_throughput/result.json